#todo: Написать программу, которая считывает два числа и выводит их сумму, разность,
# частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.


a = int(input('Введите первое число'))
b = int(input('Введите второе число'))

print(a + b)
print(a - b)
print(a / b)
print(a * b)
print(a // b)
print(a % b)
print(a ** b)