# todo: Определить в коде переменные:
# 1. Целочисленного типа
x = 1
print(type(x))
# 2. Вещественного типа
x = 2.5
print(type(x))
# 3. Логического типа
x = True
print(type(x))
# 4. Строкового типа
x = 'Zwirr'
print(type(x))
# 5. Пустого типа
x = None
print(type(x))


# Вывести их типы.